Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTagD Property
 Gets or sets a value indicating whether the part count is included in the tag D.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IncludePartCountInTagD { get; set; }
Public Property IncludePartCountInTagD As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace